spec/vcr_cassettes/StripeEvent-update_bike_index-success.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/subscriptions/sub_0Qv3uJm0T0GBfX0v77OTe6ii
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/13.4.1
      Stripe-Version:
      - 2025-01-27.acacia
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 22 Feb 2025 17:46:23 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4608'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=ImEcMSO7neyRU-ECSCpDpQSipOUk6TYrp2bTY0v1FSRAN9V2vWoJ7JAXaqEhgRCRuUNWISnUloyYjOvK
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report"
      Request-Id:
      - req_ONBHD6V27foJdj
      Stripe-Version:
      - 2025-01-27.acacia
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - AB
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "sub_0Qv3uJm0T0GBfX0v77OTe6ii",
          "object": "subscription",
          "application": null,
          "application_fee_percent": null,
          "automatic_tax": {
            "disabled_reason": null,
            "enabled": false,
            "liability": null
          },
          "billing_cycle_anchor": 1740173835,
          "billing_cycle_anchor_config": null,
          "billing_thresholds": null,
          "cancel_at": null,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "cancellation_details": {
            "comment": null,
            "feedback": null,
            "reason": null
          },
          "collection_method": "charge_automatically",
          "created": 1740173835,
          "currency": "usd",
          "current_period_end": 1742593035,
          "current_period_start": 1740173835,
          "customer": "cus_RohIc4uZhMPzxN",
          "days_until_due": null,
          "default_payment_method": "pm_0Qv3uJm0T0GBfX0vDotRCAkA",
          "default_source": null,
          "default_tax_rates": [],
          "description": null,
          "discount": null,
          "discounts": [],
          "ended_at": null,
          "invoice_settings": {
            "account_tax_ids": null,
            "issuer": {
              "type": "self"
            }
          },
          "items": {
            "object": "list",
            "data": [
              {
                "id": "si_RohIR483d0K1ok",
                "object": "subscription_item",
                "billing_thresholds": null,
                "created": 1740173836,
                "discounts": [],
                "metadata": {},
                "plan": {
                  "id": "price_0Qs5s1m0T0GBfX0visCJi4lq",
                  "object": "plan",
                  "active": true,
                  "aggregate_usage": null,
                  "amount": 999,
                  "amount_decimal": "999",
                  "billing_scheme": "per_unit",
                  "created": 1739466397,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "meter": null,
                  "nickname": null,
                  "product": "prod_Rld8cRL9WZDT4c",
                  "tiers_mode": null,
                  "transform_usage": null,
                  "trial_period_days": null,
                  "usage_type": "licensed"
                },
                "price": {
                  "id": "price_0Qs5s1m0T0GBfX0visCJi4lq",
                  "object": "price",
                  "active": true,
                  "billing_scheme": "per_unit",
                  "created": 1739466397,
                  "currency": "usd",
                  "custom_unit_amount": null,
                  "livemode": false,
                  "lookup_key": null,
                  "metadata": {},
                  "nickname": null,
                  "product": "prod_Rld8cRL9WZDT4c",
                  "recurring": {
                    "aggregate_usage": null,
                    "interval": "month",
                    "interval_count": 1,
                    "meter": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                  },
                  "tax_behavior": "unspecified",
                  "tiers_mode": null,
                  "transform_quantity": null,
                  "type": "recurring",
                  "unit_amount": 999,
                  "unit_amount_decimal": "999"
                },
                "quantity": 1,
                "subscription": "sub_0Qv3uJm0T0GBfX0v77OTe6ii",
                "tax_rates": []
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/subscription_items?subscription=sub_0Qv3uJm0T0GBfX0v77OTe6ii"
          },
          "latest_invoice": "in_0Qv3uJm0T0GBfX0vXLZmSpZb",
          "livemode": false,
          "metadata": {},
          "next_pending_invoice_item_invoice": null,
          "on_behalf_of": null,
          "pause_collection": null,
          "payment_settings": {
            "payment_method_options": {
              "acss_debit": null,
              "bancontact": null,
              "card": {
                "network": null,
                "request_three_d_secure": "automatic"
              },
              "customer_balance": null,
              "konbini": null,
              "sepa_debit": null,
              "us_bank_account": null
            },
            "payment_method_types": null,
            "save_default_payment_method": "off"
          },
          "pending_invoice_item_interval": null,
          "pending_setup_intent": null,
          "pending_update": null,
          "plan": {
            "id": "price_0Qs5s1m0T0GBfX0visCJi4lq",
            "object": "plan",
            "active": true,
            "aggregate_usage": null,
            "amount": 999,
            "amount_decimal": "999",
            "billing_scheme": "per_unit",
            "created": 1739466397,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "meter": null,
            "nickname": null,
            "product": "prod_Rld8cRL9WZDT4c",
            "tiers_mode": null,
            "transform_usage": null,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "quantity": 1,
          "schedule": null,
          "start_date": 1740173835,
          "status": "active",
          "test_clock": null,
          "transfer_data": null,
          "trial_end": null,
          "trial_settings": {
            "end_behavior": {
              "missing_payment_method": "create_invoice"
            }
          },
          "trial_start": null
        }
  recorded_at: Sat, 22 Feb 2025 17:46:23 GMT
recorded_with: VCR 6.3.1
